In [5]:
import pandas as pd
from pandas import Series # データ列

In [3]:
obj = Series([3,6,9,12])
# Series は配列と違ってインデックスがついている

In [4]:
obj

0     3
1     6
2     9
3    12
dtype: int64

In [7]:
obj.values
# データだけ(インデックスなし)

array([ 3,  6,  9, 12], dtype=int64)

In [8]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
#index付きのデータを作る
#第二次世界大戦の死傷者
ww2_cas = Series([8700000,4300000,3000000,2100000,400000],index=['USSR','Germany','China','Japan','USA'])
ww2_cas

USSR       8700000
Germany    4300000
China      3000000
Japan      2100000
USA         400000
dtype: int64

In [10]:
ww2_cas.index

Index(['USSR', 'Germany', 'China', 'Japan', 'USA'], dtype='object')

In [11]:
obj[0]

3

In [12]:
# 文字列のindexでアクセスできる。
ww2_cas['USA']

400000

In [13]:
# 400万人以上の死傷者を出したのは？
ww2_cas[ww2_cas>4000000]

USSR       8700000
Germany    4300000
dtype: int64

In [14]:
ww2_cas>4000000

USSR        True
Germany     True
China      False
Japan      False
USA        False
dtype: bool

In [15]:
# 普通の辞書のように扱えます。
# USSR があるか？
'USSR' in ww2_cas

True

In [16]:
# 辞書型に変換できます。
ww2_dict = ww2_cas.to_dict()
ww2_dict

{'China': 3000000,
 'Germany': 4300000,
 'Japan': 2100000,
 'USA': 400000,
 'USSR': 8700000}

In [17]:
# 辞書をもとに、Seriesを作ることができます。
WW2_Series = Series(ww2_dict)
WW2_Series

China      3000000
Germany    4300000
Japan      2100000
USA         400000
USSR       8700000
dtype: int64

In [18]:
# indexを明示的に与えることができます。たとえば・・・
countries = ['China','Germany','Japan','USA','USSR','Argentina']

In [19]:
# 別のSeriesを作ります
obj2 = Series(ww2_dict,index=countries)

In [21]:
obj2

China        3000000.0
Germany      4300000.0
Japan        2100000.0
USA           400000.0
USSR         8700000.0
Argentina          NaN
dtype: float64

In [22]:
# nullデータがあるかどうかを確認できます
pd.isnull(obj2)

China        False
Germany      False
Japan        False
USA          False
USSR         False
Argentina     True
dtype: bool

In [23]:
# 逆のこともできます。
pd.notnull(obj2)

China         True
Germany       True
Japan         True
USA           True
USSR          True
Argentina    False
dtype: bool

In [25]:
# もとのデータに戻りましょう。
WW2_Series

China      3000000
Germany    4300000
Japan      2100000
USA         400000
USSR       8700000
dtype: int64

In [26]:
obj2

China        3000000.0
Germany      4300000.0
Japan        2100000.0
USA           400000.0
USSR         8700000.0
Argentina          NaN
dtype: float64

In [27]:
# 両方のデータを足すと、pandasが自動的に、indexでまとめてくれます。
WW2_Series + obj2

Argentina           NaN
China         6000000.0
Germany       8600000.0
Japan         4200000.0
USA            800000.0
USSR         17400000.0
dtype: float64

In [29]:
# Seriesに名前を付けられます。
obj2.name = '第二次世界大戦の死傷者'
obj2

China        3000000.0
Germany      4300000.0
Japan        2100000.0
USA           400000.0
USSR         8700000.0
Argentina          NaN
Name: 第二次世界大戦の死傷者, dtype: float64

In [30]:
# indexに名前を付けることも可能
obj2.index.name = 'Countries'
obj2

Countries
China        3000000.0
Germany      4300000.0
Japan        2100000.0
USA           400000.0
USSR         8700000.0
Argentina          NaN
Name: 第二次世界大戦の死傷者, dtype: float64

In [32]:
obj2.index

Index(['China', 'Germany', 'Japan', 'USA', 'USSR', 'Argentina'], dtype='object', name='Countries')

In [33]:
# まとめ１

# import pandas as pd
# from pandas import Series # データ列

# obj = Series([3,6,9,12])
# obj.values
# obj.index
# obj[1]

# Series([8700000,4300000,3000000,2100000,400000],index=['USSR','Germany','China','Japan','USA'])
# ww2_cas['USA']
# ww2_cas[ww2_cas>4000000]
# ww2_cas>4000000

# 'USSR' in ww2_cas

# ww2_dict = ww2_cas.to_dict()
# WW2_Series = Series(ww2_dict)

# countries = ['China','Germany','Japan','USA','USSR','Argentina']
# obj2 = Series(ww2_dict,index=countries)

# pd.isnull(obj2)
# pd.notnull(obj2)

# WW2_Series + obj2

# obj2.name = '第二次世界大戦の死傷者'
# obj2.index.name = 'Countries'

In [1]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

In [2]:
# NFLのデータをサンプルとして使います。
import webbrowser
website = 'http://en.wikipedia.org/wiki/NFL_win-loss_records'
webbrowser.open(website)

True

In [11]:
nfl_frame = pd.read_clipboard()
# pd.read_clipboard()　で　クリップボードにコピーした表を読み込む

In [12]:
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,898,512,380,6,0.573,1960,NFC East
1,2,Chicago Bears,"1,386",761,583,42,0.564,1920,NFC North
2,3,Green Bay Packers,"1,352",743,571,38,0.564,1921,NFC North
3,4,New England Patriots[b],900,500,391,9,0.561,1960,AFC East
4,5,Miami Dolphins,816,452,360,4,0.556,1966,AFC East
5,6,Minnesota Vikings,886,478,397,11,0.546,1961,NFC North

In [13]:
nfl_frame.columns

Index(['Rank', 'Team', 'GP', 'Won', 'Lost', 'Tied', 'Pct.', 'First NFL Season',
       'Division'],
      dtype='object')

In [15]:
nfl_frame['Division']
# 特定のカラム列だけを取得

0     NFC East
1    NFC North
2    NFC North
3     AFC East
4     AFC East
5    NFC North
Name: Division, dtype: object

In [21]:
nfl_frame.Team
# ['カラム名']　か
# .カラム名　　でアクセス

0             Dallas Cowboys
1              Chicago Bears
2          Green Bay Packers
3    New England Patriots[b]
4             Miami Dolphins
5          Minnesota Vikings
Name: Team, dtype: object

In [24]:
nfl_frame[['Team','Division']]
# []内に[]で複数のカラム列を取ってこれる

                      Team   Division
0           Dallas Cowboys   NFC East
1            Chicago Bears  NFC North
2        Green Bay Packers  NFC North
3  New England Patriots[b]   AFC East
4           Miami Dolphins   AFC East
5        Minnesota Vikings  NFC North

In [25]:
# 特定のカラムで新しいDataFrameを作る
DataFrame(nfl_frame, columns=['Team','Division'])

                      Team   Division
0           Dallas Cowboys   NFC East
1            Chicago Bears  NFC North
2        Green Bay Packers  NFC North
3  New England Patriots[b]   AFC East
4           Miami Dolphins   AFC East
5        Minnesota Vikings  NFC North

In [26]:
DataFrame(nfl_frame, columns=['Team', 'Division', 'aaaaaa'])
# 存在しないカラムを指定するとNaNが入る

                      Team   Division  aaaaaa
0           Dallas Cowboys   NFC East     NaN
1            Chicago Bears  NFC North     NaN
2        Green Bay Packers  NFC North     NaN
3  New England Patriots[b]   AFC East     NaN
4           Miami Dolphins   AFC East     NaN
5        Minnesota Vikings  NFC North     NaN

In [27]:
nfl_frame.head(3)
# 上から3行取り出す

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,898,512,380,6,0.573,1960,NFC East
1,2,Chicago Bears,"1,386",761,583,42,0.564,1920,NFC North
2,3,Green Bay Packers,"1,352",743,571,38,0.564,1921,NFC North

In [28]:
nfl_frame.tail(4)
# ↓から3行取り出す

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
2,3,Green Bay Packers,"1,352",743,571,38,0.564,1921,NFC North
3,4,New England Patriots[b],900,500,391,9,0.561,1960,AFC East
4,5,Miami Dolphins,816,452,360,4,0.556,1966,AFC East
5,6,Minnesota Vikings,886,478,397,11,0.546,1961,NFC North

In [30]:
# indexを使って、行を取り出せる
nfl_frame.iloc[3]

Rank                                      4
Team                New England Patriots[b]
GP                                      900
Won                                     500
Lost                                    391
Tied                                      9
Pct.                                  0.561
First NFL Season                       1960
Division                           AFC East
Name: 3, dtype: object

In [31]:
nfl_frame['Stadium'] = "Levis's Stadium"
# 存在しないカラムに追加すると

In [34]:
# 全部に同じものが挿入される（列全体に値を代入）
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division,Stadium
0,1,Dallas Cowboys,898,512,380,6,0.573,1960,NFC East,Levis's Stadium
1,2,Chicago Bears,"1,386",761,583,42,0.564,1920,NFC North,Levis's Stadium
2,3,Green Bay Packers,"1,352",743,571,38,0.564,1921,NFC North,Levis's Stadium
3,4,New England Patriots[b],900,500,391,9,0.561,1960,AFC East,Levis's Stadium
4,5,Miami Dolphins,816,452,360,4,0.556,1966,AFC East,Levis's Stadium
5,6,Minnesota Vikings,886,478,397,11,0.546,1961,NFC North,Levis's Stadium

In [40]:
# 長さが合っていれば、列への代入が可能。
nfl_frame["Stadium"] = np.arange(6)
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division,Stadium
0,1,Dallas Cowboys,898,512,380,6,0.573,1960,NFC East,0
1,2,Chicago Bears,"1,386",761,583,42,0.564,1920,NFC North,1
2,3,Green Bay Packers,"1,352",743,571,38,0.564,1921,NFC North,2
3,4,New England Patriots[b],900,500,391,9,0.561,1960,AFC East,3
4,5,Miami Dolphins,816,452,360,4,0.556,1966,AFC East,4
5,6,Minnesota Vikings,886,478,397,11,0.546,1961,NFC North,5

In [41]:
# SeriesをDataFrameに追加する
# 準備
stadiums = Series(["Levi's Stadium","AT&T Stadium"],index=[4,0])
stadiums

4    Levi's Stadium
0      AT&T Stadium
dtype: object

In [42]:
#追加
nfl_frame['Stadium']=stadiums
nfl_frame
# 対応したインデックスの行にのみ追加される

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division,Stadium
0,1,Dallas Cowboys,898,512,380,6,0.573,1960,NFC East,AT&T Stadium
1,2,Chicago Bears,"1,386",761,583,42,0.564,1920,NFC North,NaN
2,3,Green Bay Packers,"1,352",743,571,38,0.564,1921,NFC North,NaN
3,4,New England Patriots[b],900,500,391,9,0.561,1960,AFC East,NaN
4,5,Miami Dolphins,816,452,360,4,0.556,1966,AFC East,Levi's Stadium
5,6,Minnesota Vikings,886,478,397,11,0.546,1961,NFC North,NaN

In [43]:
# 列を消すことも可能
del nfl_frame['Stadium']
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,898,512,380,6,0.573,1960,NFC East
1,2,Chicago Bears,"1,386",761,583,42,0.564,1920,NFC North
2,3,Green Bay Packers,"1,352",743,571,38,0.564,1921,NFC North
3,4,New England Patriots[b],900,500,391,9,0.561,1960,AFC East
4,5,Miami Dolphins,816,452,360,4,0.556,1966,AFC East
5,6,Minnesota Vikings,886,478,397,11,0.546,1961,NFC North

In [44]:
# 辞書からDataFramesを作ることもできます。
data = { 'City' : ['SF', 'LA', 'NYC'],
             'Population' : [837000, 3880000, 8400000]}

city_frame = DataFrame(data)

#Show
city_frame

  City  Population
0   SF      837000
1   LA     3880000
2  NYC     8400000

In [45]:
# まとめ

# データフレーム（テーブル）を使う
# import numpy as np
# from pandas import Series, DataFrame
# import pandas as pd

# クリップボードから作れる
# nfl_frame = pd.read_clipboard()

# カラム(列)関係
# nfl_frame.columns
# nfl_frame['Division']
# nfl_frame.division

# インデックス(行)関係
# nfl_frame.iloc[3]

# データフレーム作成
# ・DataFrame(取得するデータフレームの変数, 引き出すカラム指定)
# DataFrame(nfl_frame, columns=['Team', 'Division', 'aaaaaa'])　aaaaaaは存在しないカラム


# nfl_frame.head(3)
# nfl_frame.tail(4)


# 存在しないカラムに新しく追加できる
# nfl_frame['Stadium'] = "Levis's Stadium"
# nfl_frame["Stadium"] = np.arange(6)

# Seriesをカラムとして追加できる
# stadiums = Series(["Levi's Stadium","AT&T Stadium"],index=[4,0])
# nfl_frame['Stadium']=stadiums

# del nfl_frame['Stadium']

# 辞書からDataFramesを作れる。
# data = { 'City' : ['SF', 'LA', 'NYC'],
#              'Population' : [837000, 3880000, 8400000]}

# city_frame = DataFrame(data)

In [46]:
#indexについて学んでいきます。
my_ser = Series([1,2,3,4],index=['A','B','C','D'])
# indexだけを取り出します。
my_index = my_ser.index

In [47]:
my_ser

A    1
B    2
C    3
D    4
dtype: int64

In [48]:
my_index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [49]:
my_index[2]

'C'

In [50]:
my_index[1:]

Index(['B', 'C', 'D'], dtype='object')

In [51]:
# indexの値を変えることができるでしょうか？
my_index[0] = 'Z'

TypeError: Index does not support mutable operations

In [53]:
ser1 = Series([1,2,3,4],index=['A','B','C','D'])


#  reindexを使って、indexを変えられます。
ser2 = ser1.reindex(['A','B','C','D','E','F'])

In [55]:
ser2
# 自動的に、nullが入ります。

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [56]:
# 新しいindexの値を埋めることもできます。
ser2.reindex(['A','B','C','D','E','F','G'], fill_value=0)

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
G    0.0
dtype: float64

In [57]:
ser3 = Series(['USA','Mexico','Canada'],index=[0,5,10])

ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [58]:
# ffillは、forward fillの略です。
ser3.reindex(range(15),method='ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [61]:
from numpy.random import randn

# 行と列の両方について、Reindexを考えます。
# reshapeを使ってDataFrameを作ってみます。
dframe = DataFrame(randn(25).reshape((5,5)),index=['A','B','D','E','F'],columns=['col1','col2','col3','col4','col5'])
dframe

       col1      col2      col3      col4      col5
A -1.102609 -0.413753 -1.313092 -0.754923  0.765437
B -2.326685  0.749097  0.029486 -0.065140 -1.730567
D  1.673955  1.243960 -1.030355 -1.365869 -0.047287
E  0.828629  0.854674  1.175296 -1.614783  0.436049
F  1.062913 -0.786710 -0.835324  1.099476 -0.480780

In [62]:
# Cを忘れたので変更する
new_index = ['A','B','C','D','E','F']
dframe2 = dframe.reindex(new_index)
dframe2

       col1      col2      col3      col4      col5
A -1.102609 -0.413753 -1.313092 -0.754923  0.765437
B -2.326685  0.749097  0.029486 -0.065140 -1.730567
C       NaN       NaN       NaN       NaN       NaN
D  1.673955  1.243960 -1.030355 -1.365869 -0.047287
E  0.828629  0.854674  1.175296 -1.614783  0.436049
F  1.062913 -0.786710 -0.835324  1.099476 -0.480780

In [63]:
#列にも同じような操作ができます。
new_columns = ['col1','col2','col3','col4','col5','col6']

dframe2.reindex(columns=new_columns)

       col1      col2      col3      col4      col5  col6
A -1.102609 -0.413753 -1.313092 -0.754923  0.765437   NaN
B -2.326685  0.749097  0.029486 -0.065140 -1.730567   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D  1.673955  1.243960 -1.030355 -1.365869 -0.047287   NaN
E  0.828629  0.854674  1.175296 -1.614783  0.436049   NaN
F  1.062913 -0.786710 -0.835324  1.099476 -0.480780   NaN

In [64]:
dframe

       col1      col2      col3      col4      col5
A -1.102609 -0.413753 -1.313092 -0.754923  0.765437
B -2.326685  0.749097  0.029486 -0.065140 -1.730567
D  1.673955  1.243960 -1.030355 -1.365869 -0.047287
E  0.828629  0.854674  1.175296 -1.614783  0.436049
F  1.062913 -0.786710 -0.835324  1.099476 -0.480780

In [69]:

# ixを使うと、素早くReindexが可能です。
dframe.ix[new_index, new_columns]

       col1      col2      col3      col4      col5  col6
A -1.102609 -0.413753 -1.313092 -0.754923  0.765437   NaN
B -2.326685  0.749097  0.029486 -0.065140 -1.730567   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D  1.673955  1.243960 -1.030355 -1.365869 -0.047287   NaN
E  0.828629  0.854674  1.175296 -1.614783  0.436049   NaN
F  1.062913 -0.786710 -0.835324  1.099476 -0.480780   NaN

In [70]:
# まとめ　インデックス・カラム

# my_ser = Series([1,2,3,4],index=['A','B','C','D'])
# my_index = my_ser.index

# アクセス
# my_index[2]
# my_index[1:]

# インデックスの変更・追加
# my_index[0] = 'Z'　←できないエラーになる

# ser1 = Series([1,2,3,4],index=['A','B','C','D'])
# ser2 = ser1.reindex(['A','B','C','D','E','F'])
# ser2.reindex(['A','B','C','D','E','F','G'], fill_value=0)
# ser3 = Series(['USA','Mexico','Canada'],index=[0,5,10])
# ser3.reindex(range(15),method='ffill')


# dframe = DataFrame(randn(25).reshape((5,5)),index=['A','B','D','E','F'],columns=['col1','col2','col3','col4','col5'])

# new_index = ['A','B','C','D','E','F']
# dframe2 = dframe.reindex(new_index)
# new_columns = ['col1','col2','col3','col4','col5','col6']
# dframe2.reindex(columns=new_columns)

# dframe.ix[new_index, new_columns]

In [71]:
ser1 = Series(np.arange(3),index=['a','b','c'])
ser1

a    0
b    1
c    2
dtype: int32

In [72]:
# indexを消すにはdropを使う
ser1.drop('b')

a    0
c    2
dtype: int32

In [73]:
# DataFrameの場合
dframe1 = DataFrame(np.arange(9).reshape((3,3)),index=['SF','LA','NY'],columns=['pop','size','year'])
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [74]:

# indexを指定して、行を削除
dframe1.drop('LA') #, axis=0が省略されている

    pop  size  year
SF    0     1     2
NY    6     7     8

In [75]:

# 列（カラム）を削除することも可能です。
# その場合、列の軸を示す、axis=1が必要
dframe1.drop('year',axis=1)

    pop  size
SF    0     1
LA    3     4
NY    6     7

In [76]:
ser1 = Series(np.arange(3),index=['A','B','C'])
# 各要素を２倍します。
ser1 = 2*ser1
ser1

A    0
B    2
C    4
dtype: int32

In [77]:
ser1['B']

2

In [79]:
# 数字の添え字でもアクセスできます。
ser1[1]

2

In [80]:
# 数字の添え字で範囲も指定できます。
ser1[0:3]

A    0
B    2
C    4
dtype: int32

In [81]:
# 文字列のindexをリストで与えることも可能です。
ser1[['A','B','C']]

A    0
B    2
C    4
dtype: int32

In [82]:

# 論理式を与えることもできます。
ser1[ser1>3]

C    4
dtype: int32

In [83]:
# 条件に合った場所の値を変更できます。
ser1[ser1>3] = 10
ser1

A     0
B     2
C    10
dtype: int32

In [84]:

# DataFrameの場合
dframe = DataFrame(np.arange(25).reshape((5,5)),index=['NYC','LA','SF','DC','Chi'],columns=['A','B','C','D','E'])
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [85]:
# 列（カラム）の名前で選択
dframe['B']

NYC     1
LA      6
SF     11
DC     16
Chi    21
Name: B, dtype: int32

In [86]:
# リストで、複数のカラムを選択できます。
dframe[['B','E']]

      B   E
NYC   1   4
LA    6   9
SF   11  14
DC   16  19
Chi  21  24

In [87]:
# 論理式を与えることも可能
dframe[dframe['C']>8]

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [88]:
# 真偽値（ブーリアン）をそのまま表示することも可能です。
dframe> 10

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF   False   True   True   True   True
DC    True   True   True   True   True
Chi   True   True   True   True   True

In [92]:
# すでに出てきていますが、ixを使うと、行を選択できます。
dframe.loc['LA']

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int32

In [94]:
# ixには、数字の添え字も渡せます。
dframe.ix[1]

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int32

In [95]:
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [96]:
# まとめ　データの削除・取り出し


# 削除
# ser1 = Series(np.arange(3),index=['a','b','c'])
# ser1.drop('b')

# dframe1 = DataFrame(np.arange(9).reshape((3,3)),index=['SF','LA','NY'],columns=['pop','size','year'])
# dframe1.drop('LA') #, axis=0が省略されている
# dframe1.drop('year',axis=1)


# アクセス
# ser1 = Series(np.arange(3),index=['A','B','C'])
# ser1['B']
# ser1[1]
# ser1[0:3]
# ser1[['A','B','C']]
# ser1[ser1>3]
# ser1[ser1>3] = 10　代入できる

# dframe = DataFrame(np.arange(25).reshape((5,5)),index=['NYC','LA','SF','DC','Chi'],columns=['A','B','C','D','E'])
# dframe['B']
# dframe[['B','E']]
# dframe[dframe['C']>8]
# dframe> 10
# dframe.loc['LA']
# dframe.ix[1]

In [98]:
# Seriesを2つ作ります
ser1 = Series([0,1,2],index=['A','B','C'])

ser2 = Series([3,4,5,6],index=['A','B','C','D'])

In [99]:
# 足し合わせてみる
ser1 + ser2
# NaNが自動的に追加されます。

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [100]:
# DataFrameの場合。
dframe1 = DataFrame(np.arange(4).reshape(2,2),columns=list('AB'),index=['NYC','LA'])
dframe1

     A  B
NYC  0  1
LA   2  3

In [101]:
dframe2 = DataFrame(np.arange(9).reshape(3,3),columns=list('ADC'),index=['NYC','SF','LA'])
dframe2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [102]:
# 足し合わせるとどうなるでしょうか？
dframe1 + dframe2

       A   B   C   D
LA   8.0 NaN NaN NaN
NYC  0.0 NaN NaN NaN
SF   NaN NaN NaN NaN

In [104]:
# addというメソッドを使うと、NaNを置き換えられます。
dframe1.add(dframe2,fill_value=0)

# SF-Bだけ元々存在しないので、置き換わりようがありません。

       A    B    C    D
LA   8.0  3.0  8.0  7.0
NYC  0.0  1.0  2.0  1.0
SF   3.0  NaN  5.0  4.0

In [105]:
# DataFrameとSeriesの計算もできます。

In [106]:
dframe2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [108]:
# 最初の行で、Seriesを作ります。
ser3 = dframe2.iloc[0]
ser3

A    0
D    1
C    2
Name: NYC, dtype: int32

In [109]:
# 行ごとに引き算されているのがわかります。
dframe2-ser3

     A  D  C
NYC  0  0  0
SF   3  3  3
LA   6  6  6

In [110]:
# まとめ　加法

# dframe1 = DataFrame(np.arange(4).reshape(2,2),columns=list('AB'),index=['NYC','LA'])
# dframe2 = DataFrame(np.arange(9).reshape(3,3),columns=list('ADC'),index=['NYC','SF','LA'])

# dframe1 + dframe2
# dframe1.add(dframe2,fill_value=0)

# DataFrameとSeriesの計算。
# ser3 = dframe2.iloc[0]
# # 行ごとに引き算されているのがわかります。
# dframe2-ser3

In [111]:
ser1 = Series(range(3),index=['C','A','B'])
ser1

C    0
A    1
B    2
dtype: int64

In [112]:
# indexで並べ替え(インデックスの早い順)
ser1.sort_index()

A    1
B    2
C    0
dtype: int64

In [113]:
ser1

C    0
A    1
B    2
dtype: int64

In [116]:
# 値で並べ替えももちろんできます。
ser1.sort_values()

C    0
A    1
B    2
dtype: int64

In [117]:
from numpy.random import randn
ser2 = Series(randn(10))
ser2

0    0.801069
1    0.711543
2    2.502918
3   -1.499351
4    2.069741
5    0.331504
6    1.196575
7   -0.357320
8    1.098409
9    0.074068
dtype: float64

In [118]:
# 何番目に来るかを出せる。
ser2.rank()

0     6.0
1     5.0
2    10.0
3     1.0
4     9.0
5     4.0
6     8.0
7     2.0
8     7.0
9     3.0
dtype: float64

In [121]:
ser3 = ser2.sort_values()
ser3

3   -1.499351
7   -0.357320
9    0.074068
5    0.331504
1    0.711543
0    0.801069
8    1.098409
6    1.196575
4    2.069741
2    2.502918
dtype: float64

In [122]:
ser3.rank()

3     1.0
7     2.0
9     3.0
5     4.0
1     5.0
0     6.0
8     7.0
6     8.0
4     9.0
2    10.0
dtype: float64

In [ ]:
# まとめ ソートとランク

# ser1.sort_index()
# ser1.sort_values()
# ser1.rank()

# from numpy.random import randn
# ser2 = Series(randn(10))
# ser2
# ser3 = ser2.sort_values()

In [124]:
arr = np.array([[1,2,np.nan],[np.nan,3,4]])
arr

array([[ 1.,  2., nan],
       [nan,  3.,  4.]])

In [125]:
dframe1 = DataFrame(arr,index=['A','B'],columns = ['One','Two','Three'])
dframe1

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  3.0    4.0

In [126]:
# 合計を求めるsum
#行方向に計算が進むので、列の合計が見られます。
# axis=0が省略されている
# NaNは無視される
dframe1.sum()

One      1.0
Two      5.0
Three    4.0
dtype: float64

In [127]:
#行の合計を求めたいときは、列方向（axis=1）で計算
dframe1.sum(axis=1)

A    3.0
B    7.0
dtype: float64

In [128]:
# 最小値を求める。
dframe1.min()

One      1.0
Two      2.0
Three    4.0
dtype: float64

In [129]:
# 最大値を求める。
dframe1.max()

One      1.0
Two      3.0
Three    4.0
dtype: float64

In [130]:
# 最小値を保持しているindexを調べられます。
dframe1.idxmin()

One      A
Two      A
Three    B
dtype: object

In [131]:
dframe1

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  3.0    4.0

In [132]:
# 累積を求めることができます。(足しこんでいくこと)（列方向）
dframe1.cumsum()

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  5.0    4.0

In [133]:

# DataFrameの全体像を簡単に見ることができます。
dframe1.describe()

       One       Two  Three
count  1.0  2.000000    1.0
mean   1.0  2.500000    4.0
std    NaN  0.707107    NaN
min    1.0  2.000000    4.0
25%    1.0  2.250000    4.0
50%    1.0  2.500000    4.0
75%    1.0  2.750000    4.0
max    1.0  3.000000    4.0

In [151]:

# 株価のデータを使って、共分散と相関をみていきましょう。
# PandasはWebからデータをとってくることも可能です。
import pandas_datareader as pdr
# 日付を扱うために、datetimeをimportします。
import datetime
# 米国のYahooのサービスを使って、株価を取得します。
# すべて石油関連会社
# CVX シェブロン、XOM エクソンモービル、BP 英BP
prices = pdr.DataReader(['CVX','XOM','BP'],'iex',
                                            start=datetime.datetime(2018, 1, 1),
                                            end=datetime.datetime(2019, 1, 1))
prices

2y

{'BP':                open     high      low    close    volume
 date
 2018-01-02  39.1908  39.5355  38.9578  39.4889   4204919
 2018-01-03  39.5355  39.9641  39.4889  39.9455   4753619
 2018-01-04  40.0760  40.2250  39.9735  40.1039   6113799
 2018-01-05  40.1132  40.2064  39.8989  40.1598   3846437
 2018-01-08  40.0573  40.1785  39.9408  40.1412   3156186
 2018-01-09  39.9735  40.0666  39.7638  39.9455   3450808
 2018-01-10  40.0946  40.1785  39.9735  39.9735   2743226
 2018-01-11  40.0573  40.5791  39.9921  40.3182   7676587
 2018-01-12  40.7562  40.9880  40.6537  40.9146   5649809
 2018-01-16  39.9548  39.9981  39.5204  39.5635   8618371
 2018-01-17  39.7964  40.1412  39.5170  39.9548   4337214
 2018-01-18  39.8803  40.1598  39.8057  39.9735   5004543
 2018-01-19  39.5914  39.6380  39.3221  39.5076   5493967
 2018-01-22  39.9828  40.4300  39.9735  40.4300  10260864
 2018-01-23  40.3462  40.4631  40.1319  40.2903   6382641
 2018-01-24  40.9798  41.1848  40.7060  40.9425   9785579
 2018-01-25  41.5202  41.5715  40.7282  40.7562   6220449
 2018-01-26  40.9798  41.1382  40.7562  40.8214   3920371
 2018-01-29  40.5978  40.6687  40.3183  40.3928   4881510
 2018-01-30  40.4300  40.4300  39.8803  39.8896   8185835
 2018-01-31  39.9921  40.0480  39.6287  39.8710   4465904
 2018-02-01  39.8803  40.4207  39.8057  40.4021   6508840
 2018-02-02  39.6939  39.7032  38.2869  38.3522   9559699
 2018-02-05  37.9981  38.0819  33.6839  37.0663  16464942
 2018-02-06  36.8427  38.0540  36.7309  37.8024  10875153
 2018-02-07  37.7745  38.2124  37.1921  37.2713   8591264
 2018-02-08  37.7745  37.9058  36.8427  36.8520   8618029
 2018-02-09  36.5818  36.8054  35.3145  36.4420  11432480
 2018-02-12  36.9079  37.2620  36.8334  37.1502   7224289
 2018-02-13  37.0011  37.1688  36.8893  36.9824   4329491
 ...             ...      ...      ...      ...       ...
 2018-11-15  39.5906  40.5811  39.4132  40.5663   7654077
 2018-11-16  40.3791  40.5633  39.9651  40.2510   6196545
 2018-11-19  40.2115  40.3791  39.9750  40.3298   6201787
 2018-11-20  39.9947  40.0144  39.2851  39.5216   8432540
 2018-11-21  40.2510  40.9606  40.1524  40.6748   8278802
 2018-11-23  39.3048  39.5118  38.9303  39.3147   8911509
 2018-11-26  40.0538  40.2017  39.8764  39.9454   6461744
 2018-11-27  39.5906  39.8666  39.4724  39.7385   5423584
 2018-11-28  39.7976  40.3742  39.6399  40.2510   6972959
 2018-11-29  40.0933  40.3002  39.7385  39.8962   8252146
 2018-11-30  39.7385  39.8863  39.5216  39.7680   5808482
 2018-12-03  40.5959  40.7093  40.2904  40.5959   9766728
 2018-12-04  40.7438  40.8719  40.2904  40.3594   6777205
 2018-12-06  38.8514  39.0190  38.1517  39.0190  12948885
 2018-12-07  39.7286  40.0046  38.7726  38.9401  10791638
 2018-12-10  38.7529  38.9303  38.0926  38.8022   7878590
 2018-12-11  39.3245  39.3344  38.3488  38.5163   7564257
 2018-12-12  39.0781  39.1422  38.4671  38.4868   5487495
 2018-12-13  38.2404  38.8712  38.2256  38.7233   7811698
 2018-12-14  38.5459  38.7332  37.9841  38.1024   6394398
 2018-12-17  38.3488  38.4375  37.6737  37.8560   7181848
 2018-12-18  37.8560  37.8659  37.2154  37.2745   7745633
 2018-12-19  37.6589  38.0827  36.9394  37.1070   8574499
 2018-12-20  37.2745  37.5357  36.4368  36.7226   9510010
 2018-12-21  36.6635  37.4322  36.5846  37.1267  11550394
 2018-12-24  37.1957  37.2154  36.0524  36.1214   6913219
 2018-12-26  36.2594  37.5308  35.7567  37.5111   8460952
 2018-12-27  36.7916  37.1907  36.2002  37.1858   9319074
 2018-12-28  38.1123  38.1123  37.4618  37.5801   8451875
 2018-12-31  37.6589  37.9053  37.2548  37.3731   5584058

 [251 rows x 5 columns],
 'CVX':                 open      high       low     close    volume
 date
 2018-01-02  119.8355  121.7706  119.6734  121.6181   5626785
 2018-01-03  121.5037  122.9145  120.9699  122.5046   5805458
 2018-01-04  121.9708  122.3521  121.2749  122.1233   4598264
 2018-01-05  121.9899  122.1138  121.1605  121.9231   4189223
 2018-01-08  121.8850  122.6190  121.6658  122.5237   4826132
 2018-01-09  122.4284  122.9098  121.8183  121.8659   4422338
 2018-01-10  122.3140  122.7430  121.8277  122.6476   5292182
 2018-01-11  122.8955  127.0899  122.7430  126.3749  11641292
 2018-01-12  126.0127  127.5951  125.9364  127.3568   7232883
 2018-01-16  127.4235  127.6237  125.4502  125.8411   6254209
 2018-01-17  126.0127  126.5942  124.8401  126.1747   5632748
 2018-01-18  126.1652  126.3082  124.9069  125.4407   5890004
 2018-01-19  125.6695  125.8315  124.1252  125.1643   6048904
 2018-01-22  125.1643  126.3654  125.1452  126.3654   5248785
 2018-01-23  126.1938  126.3654  124.6209  124.8973   5747334
 2018-01-24  125.2405  126.4681  124.9450  125.2501   6868223
 2018-01-25  125.6028  125.7076  124.2491  124.5446   4597183
 2018-01-26  124.6018  125.5932  124.2777  125.0594   6310543
 2018-01-29  123.9822  125.4312  122.3235  122.4760   6350723
 2018-01-30  121.6467  122.0280  119.3398  119.3779   8084022
 2018-01-31  119.5590  119.9356  118.2531  119.4923   9626771
 2018-02-01  119.7306  119.7592  118.2626  119.7020   7844464
 2018-02-02  118.1577  118.1577  112.1426  113.0387  13182551
 2018-02-05  109.7880  110.4744  106.9663  107.0521   9882147
 2018-02-06  106.0035  112.1331  105.5841  111.7041  18416320
 2018-02-07  111.9138  113.6964  109.8452  109.9024  11535704
 2018-02-08  109.7880  110.4744  106.9663  107.0521   9927483
 2018-02-09  108.0435  109.2637  104.3830  108.1961  10922392
 2018-02-12  109.4353  110.4362  107.6336  108.6536   8358207
 2018-02-13  108.0435  108.2962  106.6314  107.9959   7065907
 ...              ...       ...       ...       ...       ...
 2018-11-15  112.5289  115.9148  111.5982  115.7861   7218373
 2018-11-16  116.3306  118.0830  116.1029  117.8751   6706879
 2018-11-19  116.9643  118.2909  116.7267  118.2315   5328267
 2018-11-20  118.0533  118.3107  113.8902  114.9446   7983463
 2018-11-21  115.5188  118.0038  115.5188  116.3999   5624408
 2018-11-23  113.5585  114.0733  110.9943  112.4695   5577753
 2018-11-26  113.4595  114.2911  112.8853  113.8357   6952960
 2018-11-27  113.4100  114.5090  113.0833  114.0634   6339204
 2018-11-28  113.8357  117.1029  113.2615  116.9643   6841684
 2018-11-29  116.7762  118.5384  116.5683  117.6672   6656920
 2018-11-30  116.8752  118.0236  116.5286  117.7563   6712604
 2018-12-03  119.5681  121.2116  118.8652  119.4691   8237434
 2018-12-04  119.3998  119.8849  115.9000  116.0732   8288074
 2018-12-06  114.1921  114.9842  111.9051  114.7565  10715738
 2018-12-07  116.4197  118.5087  114.0436  114.3406   9114442
 2018-12-10  114.1525  114.8060  110.5587  113.7961   7674549
 2018-12-11  115.1030  115.4594  112.8160  114.3208   5929422
 2018-12-12  115.9445  116.5485  114.4198  114.4694   7891398
 2018-12-13  114.0040  115.1624  113.1724  114.7862   7030515
 2018-12-14  113.8654  114.6575  112.1823  112.6972   6195492
 2018-12-17  112.3110  113.8258  110.7468  111.3309   7132411
 2018-12-18  111.5091  112.1130  107.8657  108.6479   9658570
 2018-12-19  108.8162  110.8755  106.0363  106.7569  10472399
 2018-12-20  105.7470  106.9945  103.1531  103.9352  11612832
 2018-12-21  102.5888  105.8757  101.8858  103.1729  19912798
 2018-12-24  102.2720  103.1135   99.9057   99.9849   5619505
 2018-12-26  100.8364  106.3213   99.2226  106.3213  10779436
 2018-12-27  104.4204  108.2419  103.8362  108.2320  10655071
 2018-12-28  108.5588  109.2617  107.0440  107.5687   6445432
 2018-12-31  108.0637  109.1429  106.7833  107.7073   6309600

 [251 rows x 5 columns],
 'XOM':                open     high      low    close    volume
 date
 2018-01-02  79.6009  80.9067  79.4490  80.7500  11469254
 2018-01-03  80.8735  82.5876  80.5506  82.3359  13957739
 2018-01-04  82.4214  82.8298  82.0795  82.4499  10863030
 2018-01-05  82.3834  82.5069  81.3910  82.3834  11047571
 2018-01-08  82.3359  82.7633  82.2442  82.7538  10927088
 2018-01-09  82.5639  82.7633  82.2885  82.4024   8131631
 2018-01-10  82.6208  82.8013  81.6522  81.7472  10822328
 2018-01-11  82.0131  82.9722  81.6047  82.5544  14366028
 2018-01-12  82.8108  83.5610  82.7918  83.1147   9834511
 2018-01-16  83.3236  83.3426  82.2410  82.5924  10882786
 2018-01-17  82.8108  83.7699  82.5544  83.5705  10545961
 2018-01-18  83.3521  83.7509  82.9437  83.0292   9223679
 2018-01-19  83.1622  83.3426  82.2505  82.7633  13090032
 2018-01-22  82.7823  83.8459  82.6683  83.8079  10270380
 2018-01-23  83.8079  84.0074  83.3236  83.8554  10281817
 2018-01-24  84.0358  84.4423  83.5800  84.0738  10316111
 2018-01-25  84.0928  84.3967  83.7604  83.9219  11271867
 2018-01-26  84.1783  84.5202  84.0169  84.5202  10514408
 2018-01-29  84.1308  84.8051  83.5230  83.5800   9315696
 2018-01-30  83.1337  83.9314  82.4119  82.4119  12407974
 2018-01-31  82.2030  83.0672  81.9846  82.9057  14404736
 2018-02-01  83.0957  84.7576  82.9532  84.5866  17971012
 2018-02-02  80.8450  81.6807  78.8201  80.2752  29822144
 2018-02-05  79.0881  79.7624  74.1973  75.7073  30452693
 2018-02-06  74.5582  76.3056  73.0292  74.4062  36262761
 2018-02-07  74.4917  75.4129  73.0482  73.0672  21994450
 2018-02-08  73.5420  73.6750  72.2030  72.2410  25650789
 2018-02-09  73.1524  73.3731  70.8979  72.7015  29491592
 2018-02-12  73.9199  74.4677  72.7600  73.3155  19340419
 2018-02-13  73.0085  73.6321  72.6535  73.2004  11926610
 ...             ...      ...      ...      ...       ...
 2018-11-15  75.8282  77.3315  75.0765  77.3315  18976021
 2018-11-16  77.5095  78.3205  77.2425  78.0930  13704889
 2018-11-19  77.5985  78.4886  77.5688  78.3502   9430819
 2018-11-20  77.5589  78.0337  75.5315  76.1249  15533723
 2018-11-21  76.5798  77.5194  76.4117  76.7084   9685726
 2018-11-23  75.2150  75.3633  73.8798  74.6611  10875425
 2018-11-26  75.4029  76.4710  75.2842  76.1348  13741093
 2018-11-27  75.7293  76.5996  75.5611  76.2040  10344600
 2018-11-28  76.1941  77.5886  75.9963  77.5886  11482133
 2018-11-29  77.3611  78.6568  77.3364  78.1919  10255232
 2018-11-30  77.5886  78.7260  77.4600  78.6271  14040141
 2018-12-03  79.3590  80.5656  79.2601  80.3282  19414847
 2018-12-04  80.4864  81.0502  78.4787  78.5579  18540692
 2018-12-06  77.1436  77.5787  76.0754  77.5293  23218054
 2018-12-07  78.5183  79.4776  76.4859  76.7875  16224694
 2018-12-10  77.0051  77.0051  73.9757  75.6996  17946162
 2018-12-11  76.8469  76.9458  74.8490  75.8381  15742418
 2018-12-12  77.1831  77.3414  75.1804  75.1853  14559839
 2018-12-13  75.1952  76.3721  75.1161  76.1348  13749746
 2018-12-14  75.8776  76.0260  74.2655  74.7501  12669300
 2018-12-17  74.4336  74.7699  72.6732  73.2270  15464117
 2018-12-18  72.8215  73.0490  70.8336  71.2094  18681179
 2018-12-19  71.6545  72.4655  69.5235  70.0028  21679608
 2018-12-20  69.3204  69.8842  67.3028  67.8764  28723650
 2018-12-21  67.3918  69.5973  66.9270  67.3720  47287319
 2018-12-24  66.1358  66.7885  64.7215  64.7907  14262825
 2018-12-26  65.4533  67.9012  63.9401  67.8863  24887738
 2018-12-27  66.9962  68.1830  65.3544  68.1830  22077044
 2018-12-28  68.4204  68.8160  67.0753  67.4215  19710603
 2018-12-31  67.5698  68.3861  66.9171  67.4413  15807007

 [251 rows x 5 columns]}

In [152]:
# まとめ

# dframe1 = DataFrame(arr,index=['A','B'],columns = ['One','Two','Three'])
# dframe1

# dframe1.sum()
# dframe1.sum(axis=1)
# dframe1.min()
# dframe1.max()
# dframe1.idxmin()
# dframe1.cumsum()
# dframe1.describe()

In [155]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

from numpy import nan #NaNのこと

In [158]:
data = Series(['one', 'two', nan, 'four'])
data

0     one
1     two
2     NaN
3    four
dtype: object

In [160]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [161]:
data.dropna()

0     one
1     two
3    four
dtype: object

In [163]:
dframe = DataFrame([[1,2,3],[nan,5,6],[7,nan,9],[nan,nan,nan]])

In [164]:
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [165]:
dframe.dropna()
# 欠損値がある行が全て消えている

     0    1    2
0  1.0  2.0  3.0

In [166]:
dframe.dropna(how='all')
# 消し方の指定　all行のすべてが欠損値なら削除する

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [167]:
dframe.dropna(axis=1)
# 列方向　欠損値ある列全て消す

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [169]:
dframe2 = DataFrame([[1,2,3,nan], [2,nan,5,6], [nan,7,nan,9], [1,nan,nan,nan]])
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [171]:
dframe2.dropna(thresh=2)
# スレッシュホールド（閾値）２
# 欠損値でないデータが2個以上

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [172]:
dframe2.dropna(thresh=3)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0

In [174]:
dframe2.fillna(1)
# NaNに1を埋める

     0    1    2    3
0  1.0  2.0  3.0  1.0
1  2.0  1.0  5.0  6.0
2  1.0  7.0  1.0  9.0
3  1.0  1.0  1.0  1.0

In [175]:
dframe2.fillna({0:0, 1:1, 2:2, 3:3})
# {列:埋める値, 列:埋める値, ...}
# とすることもできる

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  1.0  5.0  6.0
2  0.0  7.0  2.0  9.0
3  1.0  1.0  2.0  3.0

In [178]:
dframe2.fillna(0, inplace=True)
# inplaceで直接書き換えが行える

In [177]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  2.0  0.0  5.0  6.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0

In [179]:
# まとめ　欠損値の扱い

# import numpy as np
# from pandas import Series, DataFrame
# import pandas as pd

# from numpy import nan #NaNのこと


# data = Series(['one', 'two', nan, 'four'])
# data.isnull()
# data.dropna()


# dframe = DataFrame([[1,2,3],[nan,5,6],[7,nan,9],[nan,nan,nan]])
# dframe.dropna()
# dframe.dropna(how='all')
# dframe.dropna(axis=1)


# dframe2 = DataFrame([[1,2,3,nan], [2,nan,5,6], [nan,7,nan,9], [1,nan,nan,nan]])
# dframe2.dropna(thresh=2)
# dframe2.dropna(thresh=3)
# dframe2.fillna(1)
# dframe2.fillna({0:0, 1:1, 2:2, 3:3})
# dframe2.fillna(0, inplace=True)

In [180]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

from numpy.random import randn

In [185]:
ser = Series(np.random.randn(6), index=[[1,1,1,2,2,2],['a','b','c','a','b','c']])
ser

1  a    0.801966
   b    0.278408
   c   -0.729523
2  a    0.482146
   b   -0.077577
   c    0.499550
dtype: float64

In [186]:
ser.index

MultiIndex(levels=[[1, 2], ['a', 'b', 'c']],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [187]:
ser[1]

a    0.801966
b    0.278408
c   -0.729523
dtype: float64

In [189]:
ser[2]

a    0.482146
b   -0.077577
c    0.499550
dtype: float64

In [190]:
ser

1  a    0.801966
   b    0.278408
   c   -0.729523
2  a    0.482146
   b   -0.077577
   c    0.499550
dtype: float64

In [192]:
ser[:,'a']

1    0.801966
2    0.482146
dtype: float64

In [194]:
dframe = ser.unstack()
# データフレームにする
dframe

          a         b         c
1  0.801966  0.278408 -0.729523
2  0.482146 -0.077577  0.499550

In [195]:
dframe.unstack()

a  1    0.801966
   2    0.482146
b  1    0.278408
   2   -0.077577
c  1   -0.729523
   2    0.499550
dtype: float64

In [196]:
# 逆もできます。
dframe.T.unstack()

1  a    0.801966
   b    0.278408
   c   -0.729523
2  a    0.482146
   b   -0.077577
   c    0.499550
dtype: float64

In [197]:

#  DataFrameにも階層的なindexを作れます。
dframe2 = DataFrame(np.arange(16).reshape(4,4),
                    index=[['a','a','b','b'],[1,2,1,2]],
                    columns=[['NY','NY','LA','SF'],['cold','hot','hot','cold']])
dframe2

      NY      LA   SF
    cold hot hot cold
a 1    0   1   2    3
  2    4   5   6    7
b 1    8   9  10   11
  2   12  13  14   15

In [199]:
#階層的なindexに名前を付けられます。
# 行方向の名前
dframe2.index.names = ['INDEX_1','INDEX_2']
# 列方向の名前
dframe2.columns.names = ['Cities','Temp']
dframe2

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [200]:
# 階層構造を逆にすることができます。今回は列方向で試します。
dframe2.swaplevel('Cities','Temp',axis=1)

Temp            cold hot     cold
Cities            NY  NY  LA   SF
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [203]:
dframe2.sort_index(level=1)
# INDEX_1 がlevel=0 INDEX_2がlevel=1にあたる左からレベルは大きくなる

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
b       1          8   9  10   11
a       2          4   5   6    7
b       2         12  13  14   15

In [205]:
dframe2.sort_index(level=1).sort_index(level=0)
# 元に戻る

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [206]:
#レベルに応じて計算も出来ます。
dframe2.sum(level='Temp',axis=1)

Temp             cold  hot
INDEX_1 INDEX_2
a       1           3    3
        2          11   11
b       1          19   19
        2          27   27

In [ ]:
# まとめ　indexの階層構造　(レベルの概念)

# import numpy as np
# from pandas import Series, DataFrame
# import pandas as pd

# from numpy.random import randn


# ser = Series(np.random.randn(6), index=[[1,1,1,2,2,2],['a','b','c','a','b','c']])
# ser.index
# ser[1]
# ser[2]
# ser[:,'a']


# dframe = ser.unstack()
# dframe.unstack()
# dframe.T.unstack()


# dframe2 = DataFrame(np.arange(16).reshape(4,4),
#                     index=[['a','a','b','b'],[1,2,1,2]],
#                     columns=[['NY','NY','LA','SF'],['cold','hot','hot','cold']])
# dframe2.index.names = ['INDEX_1','INDEX_2']
# dframe2.columns.names = ['Cities','Temp']
# dframe2.swaplevel('Cities','Temp',axis=1)
# dframe2.sort_index(level=1)
# dframe2.sort_index(level=1).sort_index(level=0)
# dframe2.sum(level='Temp',axis=1)